---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.IsCurrentEntityValid
source: html/bed0d342-b5dd-96e5-2210-1bd8e15feb92.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.IsCurrentEntityValid Property

True if the current settings stored in the entity is valid.

## Syntax (C#)
```csharp
public bool IsCurrentEntityValid { get; set; }
```